# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

# Binaries
brew 'bash' # Latest Bash version
brew 'getantibody/tap/antibody' # ZSH Plugin Manager

brew 'git'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached
brew 'zsh'

# Development
brew 'php'
brew 'imagick'
brew 'mysql'
brew 'nginx'
brew 'nvm'
brew 'redis'

# Apps
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'github'
cask 'google-chrome'
cask 'insomnia'
cask 'java'
cask 'mysqlworkbench'
cask 'phpstorm'
cask 'sequel-pro'
cask 'slack'
cask 'tableplus'
cask 'visual-studio-code'
cask 'spotify'
cask 'iterm2'
cask 'notion'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Giphy Capture', id: 668208984
mas 'The Unarchiver', id: 425424353
mas 'Unsplash', id: 1284863847
mas 'WhatsApp', id: 1147396723
mas 'Magnet', id: 441258766
mas 'Bear', id: 1091189122