# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

# Binaries
brew 'bash' # Latest Bash version
brew 'git'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'zsh'
brew 'ffmpeg'

# Development
brew 'php'
brew 'imagick'
brew 'mysql'
brew 'nginx'
brew 'nvm'
brew 'redis'
brew 'yarn'

# Apps
cask 'alfred'
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'java'
cask 'slack'
cask 'tableplus'
cask 'visual-studio-code'
cask 'spotify'
cask 'iterm2'
cask 'notion'
cask 'figma'
cask 'the-unarchiver'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Slack', id: 803453959
mas 'Trello', id: 1278508951
mas 'WhatsApp', id: 1147396723
mas 'Magnet', id: 441258766
mas 'Pages', id: 409201541
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'TickTick', id: 966085870